@extends('admin.emp-layout')
@section('content-header')
    <!-- /.content-header -->
@endsection
@section('body')
    <!-- Main row -->
    <div class="row">
        <div class="container-fluid">
            <h5 class="card-title">คำอธบายการจัดตารางเรียน </h5>
            <p class="card-text">
                เจ้าหน้าที่หน่วยงานสามารถจัดการตารางสอนของแต่ละเทอมได้
                โดยจะแบ่งช่วงเวลาในการลงข้อมูลตามลําดับ<br />
            <ul>
                <li>เจ้าหน้าที่หน่วยงานสามารถจัดการตารางเรียนของแต่ละเทอมได้ โดยจะแบ่งช่วงเวลาในการลงข้อมูลตามลําดับ</li>

                <li> ท่านสามารถนำเข้าข้อมูลได้ จากการ Import File Excel
                    ตารางเรียนโดยกรอกข้อมูลตามรูปแบบไฟล์ตัวอย่างที่ให้เท่านั้น
                    <a href="/storage/download/schedule.xlsx" target="_blank"> >> Download << </a>
                </li>
                <li><span class="bg-danger text-white ">** เมื่อรายการของท่านขึ้นพื้นสีแดง
                        หมายความว่าไม่สามารถลงช่วงเวลานี้ได้
                        เนื่องจากมีวิชาอื่นลงตารางแล้ว
                    </span> </li>
                <li> เมื่อกดยืนยันแล้วจะไม่สามารถ แก้ไขช่วงเวลาได้ </li>
                <li> ระบบแสดงตารางเรียนตามห้องเรียน และช่วงวันที่ ที่ระบุไว้ในการเพิ่มข้อมูล </li>
                <li>กระบวนวิชาวิศวกรรมพื้นฐาน (ลงข้อมูลก่อนเปิดเทอม 4 อาทิตย์) </li>
                <li>กระบวนวิชาภาคพิเศษ (ลงข้อมูลก่อนเปิดเทอม 3 อาทิตย์)</li>
                <li>กระบวนวิชาจากภาควิชาต่างๆ (ลงข้อมูลก่อนเปิดเทอม 2 อาทิตย์) </li>
            </ul>
            </p>
        </div>
    </div>
    <!-- /.row (main row) -->
@endsection
